Repository: gyuvi02/overheadsFrontend
Catalog: src/i18n/messages.*.xlf
Languages: hu

# headerTitle
source: Apartment Management
hu: Albérlet menedzsment

# headerDescription
source: With this application, you can submit meter values.
hu: Ezzel az alkalmazással különböző mérőórák állásait diktálhatja be.

# headerLogout
source: Logout
hu: Kilépés

# loginUsername
source: Username
hu: Felhasználó

# loginUsernamePlaceholder
source: Enter your username
hu: Adja meg a felhasználónevet

# loginPassword
source: Password
hu: Jelszó

# loginPasswordPlaceholder
source: Enter your password
hu: Adja meg a jelszót

# loginButton
source: Login
hu: Belépés

# userMenuSubmitNewMeterValue
source: Submit meter value
hu: Mérőállás beküldése

# userMenuCheckLatest
source: Check latest values
hu: Legutóbbi mérőállások

# submitDataTitle
source: Submit Meter Data
hu: Mérőállás beküldése

# submitDataMeterType
source: Meter type
hu: Mérő típusa

# submitDataMeterValue
source: Meter value
hu: Mérőóra állása

# submitDataValuePlaceholder
source: Whole numbers only!
hu: Csak egész számok!

# submitDataLatestValue
source: Latest value: {{ actualValue }}
hu: Legutóbbi érték: {{ actualValue }}

# submitDataUploadImage
source: Upload image
hu: Kép feltöltése

# submitDataInformation
source: Max size: 10MB. Allowed formats: PNG, TIFF, JPG, JPEG
hu: Max méret: 10MB. Lehetséges típusok: PNG, TIFF, JPG, JPEG

# submitDataSubmit
source: Submit
hu: Beküldés

# submitDataNoFile
source: No file selected
hu: Nincs fájl kiválasztva

# selectMeterTypePlaceholder
source: Select meter type
hu: Mérőóra típusa

# LatestValuesTitle
source: Check Latest Meter Values
hu: Legutóbbi mérőállások lekérdezése

# LatestValuesTable
source: Latest Meter Values for {{ selectedMeterType }}
hu: Legutóbbi mérőállások - {{ selectedMeterType }}

# date
source: Date (year.month.day)
hu: Dátum

source: Gas meter
hu: Gázóra

source: Electricity meter
hu: Villanyóra

source: Water meter
hu: Vízóra

# errorSelectMeterType
source: Please select a meter type!
hu: Válasszon mérőóra típust!

# errorAddMeterValue
source: Please enter a meter value!
hu: Adjon meg egy mérőóra állást!

# errorAddWholeNumber
source: Please enter a whole number (integer) value!
hu: Csak egész számokat tud rögzíteni!

# errorSmallerMeterValue
source: The new meter value cannot be less than the previous value!
hu: A megadott érték nem lehet kisebb, mint a korábban rögzített!

# errorEqualMeterValue
source: The new meter value is the same as the previous value. No new value will be stored.
hu: A megadott érték ugyanaz, mint a korábban rögzített. Ezt az értéket nem rögzítem.

# errorApartmentNotFound
source: Apartment data not found. Please log in again.
hu: Nem találom a lakás adatait. Kérem, jelentkezzen be újra

# errorTokenNotFound
source: Authentication token not found. Please log in again.
hu: Az azonosító token hiányzik. Kérem, jelentkezzen be újra.

# successSubmit
source: Submission successful! Thank you!
hu: A beküldés sikerült! Köszönöm!

# errorSessionExpired
source: Session expired, please, log in again!
hu: A folyamat már lejárt. Kérem, jelentkezzen be újra.

# errorUnknownError
source: An error occurred while submitting the data. Please try again later.
hu: Váratlan hiba a rögzítés során. Kérem, próbálja meg újra később.

# errorFileSize
source: File size exceeds 10MB limit
hu: A fájl mérete nagyobb, mint a megengedett 10MB

# errorWrongFormat
source: Only PNG, TIFF, JPG and JPEG files are allowed!
hu: Csak PNG, TIFF, JPG és JPEG fájlok feltöltése megengedett!

# switchLanguage
source: HU
hu: EN
